toniebox-reverse-engineering/hackiebox_cfw_ng/ti-sdk/1.5.0/cc3200-sdk/example/tcp_socket/main.c
    UART_PRINT("Default settings: SSID Name: %s, PORT = %d, Packet Count = %d, "
                    "Destination IP: %d.%d.%d.%d\n\r",
                    SSID_NAME, g_uiPortNum, g_ulPacketCount,
                    SL_IPV4_BYTE(g_ulDestinationIp,3),
                    SL_IPV4_BYTE(g_ulDestinationIp,2),
                    SL_IPV4_BYTE(g_ulDestinationIp,1),
                    SL_IPV4_BYTE(g_ulDestinationIp,0));

    do
    {
        UART_PRINT("\r\nChoose Options:\r\n1. Send TCP packets.\r\n2. Receive "
                    "TCP packets.\r\n3. Settings.\r\n4. Exit\r\n");
        UART_PRINT("Enter the option to use: ");
        lRetVal = GetCmd(acCmdStore, sizeof(acCmdStore));
        if(lRetVal == 0)
        {
          //
          // No input. Just an enter pressed probably. Display a prompt.
          //
          UART_PRINT("\n\n\rEnter Valid Input.");
        }
        else
        {
            iInput  = (int)strtoul(acCmdStore,0,10);
          if(iInput  == 1)
          {
              UART_PRINT("Run iperf command \"iperf.exe -s -i 1 -t 100\" and press "
                            "Enter\n\r");
                //
                // Wait to receive a character over UART
                //
                MAP_UARTCharGet(CONSOLE);
                UART_PRINT("Sending TCP packets...\n\r");

              // Before proceeding, please make sure to have a server waiting on
              // PORT_NUM
              lRetVal = BsdTcpClient(g_uiPortNum);
          }
          else if(iInput  == 2)
          {
              UART_PRINT("Press Enter and run iperf command \"iperf.exe -c "
                            "%d.%d.%d.%d -i 1 -t 100000\" \n\r",
                            SL_IPV4_BYTE(g_ulIpAddr,3),
                            SL_IPV4_BYTE(g_ulIpAddr,2),
                            SL_IPV4_BYTE(g_ulIpAddr,1),
                            SL_IPV4_BYTE(g_ulIpAddr,0));
                //
                // Wait to receive a character over UART
                //
                MAP_UARTCharGet(CONSOLE);
                UART_PRINT("Receiving TCP packets...\n\r");
                // After calling this function, you can start sending data to 
                // CC3200 IP address on PORT_NUM
                  lRetVal = BsdTcpServer(g_uiPortNum);
                
          }
          else if(iInput  == 3)
          {
              iRightInput = 0;
              do
              {
                  // get input for PORT/ IP/ Packet count
              UART_PRINT("\n\rSetting Options:\n\r1. PORT\n\r2. Packet Count\n\r"
                          "3. Destination IP\n\r4. Main Menu\r\n");
              UART_PRINT("Enter the option to use: ");
              lRetVal = GetCmd(acCmdStore, sizeof(acCmdStore));
              if(lRetVal == 0)
              {
                //
                // No input. Just an enter pressed probably. Display a prompt.
                //
                UART_PRINT("\n\n\rEnter Valid Input.");
              }
              else
              {

                      iInput  = (int)strtoul(acCmdStore,0,10);
                //SettingInput(iInput);
                switch(iInput)
                {
                    case 1:
                        do
                        {
                            UART_PRINT("Enter new Port: ");
                            lRetVal = GetCmd(acCmdStore, sizeof(acCmdStore));
                            if(lRetVal == 0)
                            {
                              //
                              // No input. Just an enter pressed probably. 
                              // Display a prompt.
                              //
                              UART_PRINT("\n\rEnter Valid Input.");
                              iRightInput = 0;
                            }
                            else
                            {
                                ulUserInputData = (int)strtoul(acCmdStore,0,10);
                              if(ulUserInputData <= 0 || ulUserInputData > 65535)
                              {
                                UART_PRINT("\n\rWrong Input");
                                iRightInput = 0;
                              }
                              else
                              {
                                  g_uiPortNum = ulUserInputData;
                                iRightInput = 1;
                              }
                            }

                            UART_PRINT("\r\n");
                        }while(!iRightInput);

                        iRightInput = 0;
                        break;
                    case 2:
                        do
                        {
                            UART_PRINT("Enter Packet Count: ");
                            lRetVal = GetCmd(acCmdStore, sizeof(acCmdStore));
                            if(lRetVal == 0)
                            {
                              //
                              // No input. Just an enter pressed probably. 
                              // Display a prompt.
                              //
                              UART_PRINT("\n\rEnter Valid Input.");
                              iRightInput = 0;
                            }
                            else
                            {
                                ulUserInputData = (int)strtoul(acCmdStore,0,10);
                              if(ulUserInputData <= 0 || ulUserInputData > 9999999)
                              {
                                UART_PRINT("\n\rWrong Input");
                                iRightInput = 0;
                              }
                              else
                              {
                                  g_ulPacketCount = ulUserInputData;
                                iRightInput = 1;
                              }
                            }

                            UART_PRINT("\r\n");
                        }while(!iRightInput);
                        iRightInput = 0;
                        break;
                    case 3:
                        do
                        {
                            UART_PRINT("Enter Destination IP: ");
                            lRetVal = GetCmd(acCmdStore, sizeof(acCmdStore));
                            if(lRetVal == 0)
                            {
                              //
                              // No input. Just an enter pressed probably. 
                              // Display a prompt.
                              //
                              UART_PRINT("\n\rEnter Valid Input.");
                              iRightInput = 0;
                            }
                            else
                            {
                            if(IpAddressParser(acCmdStore) < 0)
                              {
                                UART_PRINT("\n\rWrong Input");
                                iRightInput = 0;
                              }
                              else
                              {
                                iRightInput = 1;
                              }
                            }

                            UART_PRINT("\r\n");
                        }while(!iRightInput);
                        iRightInput = 0;
                        break;
                    case 4:
                        iRightInput = 1;
                        break;


